const DateRange = {
  min: 1,
  max: 31,
};

const DESTINATION_VALUES = [
  'Amsterdam',
  'Geneva',
  'Chamonix',
  'Moscow',
  'Magadan',
];

const DESTINATION_DESCRIPTIONS = [
  'Это крупный город с богатой историей и культурой, в котором находятся знаменитые достопримечательности, такие как исторические здания и памятники.',
  'Город известен своей архитектурой в определенном стиле, расположен на берегах реки и славится музеями, дворцами и разводными мостами.',
  'Один из старейших городов, расположенный на слиянии двух рек. Город известен своими историческими сооружениями и ежегодной ярмаркой.',
  'Крупный промышленный и культурный центр, известный своей архитектурой, музеями и историческими событиями.',
  'Третий по численности населения город, расположенный в отдаленном регионе. Является важным транспортным узлом и научным центром, а также известен своими культурными учреждениями.',
];

const PHOTO_DESCRIPTIONS = [
  'Это величественное историческое здание, построенное в уникальном архитектурном стиле, которое является символом города и привлекает множество туристов.',
  'Живописный парк с красивыми садами, фонтанами и аллеями, где можно прогуляться и отдохнуть от городской суеты.',
  'Музей, в котором собрана обширная коллекция произведений искусства различных эпох и стилей, отражающих богатую культуру региона.',
  'Древняя крепость с мощными стенами и башнями, хранящая в себе многовековую историю и предлагающая захватывающие экскурсии для посетителей.',
  'Современный архитектурный комплекс с инновационным дизайном, включающий в себя выставочные залы, концертные площадки и другие культурные объекты.',
  'Величественный собор, построенный в готическом стиле, с высокими шпилями и витражными окнами, являющийся духовным центром города.',
  'Живописное озеро с чистой водой и живописными берегами, окруженное лесами и горами, предлагающее возможности для отдыха и рекреации.',
  'Археологический памятник, хранящий следы древних цивилизаций и открывающий окно в прошлое для любознательных посетителей.',
  'Современный научно-технический музей, демонстрирующий последние достижения в области науки и техники и вдохновляющий на инновации.',
  'Исторический район города с узкими улочками, старинными зданиями и атмосферой ушедших эпох, привлекающий туристов своей аутентичностью.',
];

const EVENT_TYPE_VALUES = [
  'taxi',
  'bus',
  'train',
  'ship',
  'drive',
  'flight',
  'check-in',
  'sightseeing',
  'restaurant',
];

const EVENT_TYPE_OFFERS = [
  'City tour',
  'Bike rental',
  'Sea fishing',
  'Hiking',
  'Wine tasting',
  'Boat tours',
  'Yacht rental',
  'Hot air balloon',
  'River rafting',
  'Museum visit',
  'Surfing lessons',
  'Horse riding',
  'Park visit',
  'Island tour',
  'Car rental',
  'Theater visit',
  'Cooking class',
  'Train ride',
  'Farm visit',
  'Water park',
];

export {
  DateRange,
  DESTINATION_VALUES,
  DESTINATION_DESCRIPTIONS,
  PHOTO_DESCRIPTIONS,
  EVENT_TYPE_VALUES,
  EVENT_TYPE_OFFERS,
};
